# Value Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementId..::..Value Property
ElementId Class See Also
---
Provides the value of the element id as a 64-bit integer.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public long Value { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Value As Long
	Get
```

Visual C++
---
```text
public:
property long long Value {
	long long get ();
}
```

# See Also
ElementId Class
Autodesk.Revit.DB Namespace